{"/datasets/":{"data":{"":"","datasets#Datasets":"At hackathon.lu 2026, we believe in the power of open data and large datasets to drive innovation, foster creativity, and enable groundbreaking solutions in open-source security tooling. To support participants in their projects and topics, we will provide access to a curated selection of public and semi-public datasets spanning various domains. These datasets are contributed by different organizations, and we welcome additional contributions to further enrich the resources available during the hackathon.\nIf you plan to use one of the dataset during the hackathon, let us known in advance in the hackathon.lu discourse.\nDatasets Common Crawl (Provider: Common Crawl) Common Crawl maintains a free, open repository of web crawl data that can be used by anyone.\nDuring the hackathon, the CC-MAIN-2024-51 crawl dataset (80TB+) will be available locally, including indexes.\nTerms of Use.\nCollected X.509 Certificates (Provider: CIRCL) CIRCL collects X.509 certificates using various scanning techniques.\nDuring the hackathon, a dataset in Parquet format containing over 100 million X.509 certificates will be available.\nCollected SSH Key Materials and Metadata (Provider: CIRCL) CIRCL collects SSH key materials and metadata from various scanning techniques.\nDuring the hackathon, a dataset in Parquet format will be available, containing SSH key materials and associated metadata.\nGreynoise HTTP Traffic - Log4Shell (Provider: Greynoise) A dataset in Parquet format containing HTTP traffic related to Log4Shell, collected by Greynoise between October 2021 and April 2022, will be available.\nVulnerabilities (Provider: CIRCL) Daily dumps of security advisories from over 20 sources (CVE Program, NVD, PySec, GHSA, various CSAF feeds, etc.).\nAdditionally, AI datasets and models will be available."},"title":"Datasets available at hackathon.lu"},"/news/":{"data":{"":" RSS Feed "},"title":"News"},"/practical/":{"data":{"contact#Contact":"If you need to contact the hack.lu team, please use the email: info(AT)hack(DOT)lu","hackathon-modus-operandi#Hackathon Modus Operandi":" Details about the Modus Operandi at the Hackathon ","location#Location":"LocationAlvisse Parc Hotel - 120 Route d’Echternach, 1453 Luxembourg\nFind the hotel room booking form here: https://reservations.cubilis.eu/alvisse-parc-hotel-luxembourg\nThe discount code is HACKATHON-2026.","register-a-new-project#Register a new project":"During sign-up you can select from a list of projects or suggest a new project. To prepare for the hackathon and attract more people to contribute, you can already add your projects and tasks on the website via a PR:\nThe idea behind the concept of tasks is to provide visibility to potential contributors and help other projects to identify possible collaboration opportunities, even before the actual hackathon starts.\nIt would be great if you could add tasks or ideas for tasks related to your specific projects, as well as potential interactions with other projects.\nDon’t hesitate to ask as for support if needed.","registration#Registration":" JavaScript is disabled in your browser. To access our ticket shop without JavaScript, please click here. "},"title":"Practical Details"},"/projects/":{"data":{"":"","projects-and-team-at-hackathonlu-2026#Projects and Team at hackathon.lu 2026":"The following open-source projects will be at the hackathon. If you’d like to include your project, feel free to contact us!\nMISP Project MISP, the open source threat sharing platform.\nAIL Project AIL Project is an open source framework composed of different modules to collect, crawl, dig and analyse unstructured data. AIL includes an extensible Python-based framework for analysis of unstructure information collected via an advanced Crawler manager or from different feeders (such as Twitter, Discord, Telegram Stream providers) or custom feeders.\nKunai Kunai: bring your Linux Threat-Hunting capabilities to the next level.\nFlowintel Flowintel is an open-source platform designed to assist analysts in organizing their cases and tasks. It features a range of tools and functionalities to enhance workflow efficiency.\nLacus Lacus: A capturing system using playwright, as a web service.\nLookyloo Lookylooo is a web interface that captures a webpage and then displays a tree of the domains, that call each other.\nPandora Pandora is an analysis framework to discover if a file is suspicious and conveniently show the results.\nVulnerability-Lookup Vulnerability-Lookup facilitates quick correlation of vulnerabilities from various sources, independent of vulnerability IDs, and streamlines the management of Coordinated Vulnerability Disclosure (CVD).\nVulnTrain VulnTrain is a tool for generating diverse datasets and models using vulnerability data from Vulnerability-Lookup.\nIt leverages all vulnerability advisory sources supported by Vulnerability-Lookup to train models, utilizing over one million JSON records. Additionally, data from the vulnerability-lookup:meta container, including enrichment sources such as vulnrichment and Fraunhofer FKIE, is incorporated to enhance model quality.\nVarious models are already available on Hugging Face and we are always interested in new ideas (datasets, trainers, integration with Vulnerability-Lookup, …)!\nOISF and Suricata Suricata is a high performance, open source network analysis and threat detection software used by most private and public organizations, and embedded by major vendors to protect their assets.\ncocktailparty cocktailparty is a websocket data brocker system based on the phoenix framework.\nMercator Mercator is a powerful and versatile open-source web application designed to facilitate the mapping of information systems, as outlined in the Mapping The Information System Guide by ANSSI. Whether you’re an operator of vital importance or part of a broader IT governance framework, Mercator is an essential tool for gaining visibility, control, and ensuring the resilience of your information systems.\nsysdiagnose analysis framework sysdiagnose is an open-source framework developed to facilitate the analysis of the Apple sysdiagnose files and especially the one generated on mobile devices (iOS / iPadOS). In the light of targeted attacks against journalists, activist, representatives from the civil society and politicians, it empowered incident response team to review device behaviour and ensure their integrity. This tool is initially the result of a joint effort between EC DIGIT CSOC (European Commission DG DIGIT) and CERT-EU (https://cert.europa.eu/).\nYALTF (Yet Another License Tool and Framework) YALTF is a tool designed to scan and gather software licenses across multiple remote systems. It connects to target systems via SSH and collects information about installed packages and their associated licenses. It features Remote system scanning via SSH, Parallel scanning of multiple targets, Support for CentOS, Fedora, RHEL (Rocky) and OpenSUSE, Structured JSON output. This tool was initially developed by the International Committee of the Red Cross (ICRC) in collaboration with Cortex Security S.A.\nIDPS-ESCAPE IDPS-ESCAPE (Intrusion Detection and Prevention Systems for Evading Supply Chain Attacks and Post-compromise Effects), part of project CyFORT, is an open-source SOAR system powered by a dedicated anomaly detection toolbox (ADBox), integrated with open-source software such as Wazuh and Suricata. The ADBox provides an extensible framework for integrating different AD algorithms and currently includes an implementation of MTAD-GAT, a Multivariate Time-series Anomaly Detection (MTAD) algorithm relying on Graph Attention Networks (GAT).\nSATRAP SATRAP (Semi-Automated Threat Reconnaissance and Analysis Platform) part of project CyFORT, is an open-source, cross-platform software aimed at supporting computer-aided analysis of cyber threat intelligence (CTI) by leveraging automated reasoning and inference. At its core, SATRAP implements a knowledge representation system (KRS) consisting of a CTI knowledge base coupled with a reasoning engine for inferring new knowledge, built on top of TypeDB. The KRS grounds SATRAP into formal underpinnings, enabling the introduction of semantics into the storage, processing, and analysis of CTI.\nMISPERER MISPerer MISPerer implements Anthropics’s Model Context Protocol (MCP) to enable Large Language Models (LLMs) to interact directly with the MISP threat intelligence platform. This allows users and automated systems to query and analyze MISP data using natural language prompts.\nRange42 Range42 is a modular cyber range platform designed for real-world readiness. We build, deploy, and document offensive, defensive, and hybrid cyber training environments using reproducible, infrastructure-as-code methodologies."},"title":"Projects at hackathon.lu"},"/sponsoring/":{"data":{"contact#Contact":"Contact us at info(AT)hack(DOT)lu if you want to sponsor hackathon.lu which could be also combined with hack.lu 2026 sponsoring.\nWe are open to any specific partnership proposals as well. Do not hesitate to get in touch for any inquiries.","sponsoring-packages#Sponsoring Packages":"Sponsoring the 2026 Hackathon is a unique opportunity to connect with top cybersecurity talent, support innovation, and gain early access to cutting-edge open-source security solutions.\nKey takeaways:\nConnects to Talent: Directly links sponsorship with access to skilled individuals. Highlights Innovation: Emphasizes the event’s role in driving new ideas. Early Access: Suggests a competitive advantage in seeing emerging tech. Sponsoring Packages Cardinal Sponsor is 5000 Euro. Medium logo on printed matters and the website along with a small stand/booth in the hallway. Scarlet Sponsor is 2500 Euro. Medium logo on the website. "},"title":"Sponsoring hackathon.lu 2026"},"/topics/":{"data":{"":"","topics-and-projects-at-hackathonlu-2026#Topics and Projects at hackathon.lu 2026":"A series of topics are available for Hackathon 2026, along with potential task ideas. This list will be regularly updated based on feedback and the projects joining the event.\nCyber Threat Intelligence Explore innovative ways to collect, analyze, and share threat intelligence to enhance cyber defenses and facilitate proactive responses to evolving threats.\nTask - Improve the visualisation of MISP taxonomies and galaxies and make it accessible to a larger community. Task CTI-VIS-INFO Improve the visualisation of MISP taxonomies and galaxies and make it accessible to a larger community. Task Lead MISP Project - taxonomies and galaxy maintainers. References\n- https://www.misp-galaxy.org/\n- https://github.com/MISP/misp-galaxy/\n- https://github.com/MISP/misp-taxonomies Task - Add MISP workflow action to send messages to nextcloud chat Task MISP-WORKFLOW-NEXTCLOUD-CHAT Task Lead: Jeroen Pinoy - MISP contributor References\n- Nexctcloud chat API doc Task - Add functionality to MISP modules and/or MISP, to keep an audit record of the usage of modules (timestamps + user) Task MISP-MODULES-AUDIT Task Lead: References\n- MISP modules repo Task - Review and update the MISP OpenAPI documentation (especially the allowed arguments), using the real MISP documentation Task MISP-OPENAPI-DOC Task Lead: Jeroen Pinoy - MISP contributor Task - Build a set of examples of common cyber threat intelligence sharing scenarios (e.g. malware sample executed by cron job), with resulting MISP encoded version of the scenario data, along with explanations. Task MISP-CTI-ENCODING-SCENARIO-SAMPLES Build a set of examples of common cyber threat intelligence sharing scenarios (e.g. malware sample executed by cron job), with resulting MISP encoded version of the scenario data, along with explanations. Task Lead: Jeroen Pinoy - MISP contributor References\n- https://www.misp-project.org/misp-training/b.1-best-practices-in-threat-intelligence.pdf - https://www.circl.lu/doc/misp/best-practices/ Task - Create MISP incident response playbooks / guidelines Task MISP-IR-PLAYBOOKS The goal is to create documentation for what to look at when trying to answer “Is the user activity of user X on MISP suspicious?”. The doc should contain information on how to interpret logs, audit info… This falls under larger umbrella of how to detect and analyze potential abuse on a MISP instance. Task Lead: Task - Review and update the MISP generated Suricata rules Task MISP-SURICATA-RULES Review and update the way MISP generated Suricata rules possibly using datasets feature of stable Suricata versions Task Lead: Eric Leblond - Suricata contributor Task - Connect Suricata 8 dataset in JSON format feature with MISP Task MISP-SURICATA-DATAJSON Review and update the way MISP generated Suricata rules possibly using datasets feature of stable Suricata versions Reference\n- Dataset with JSON format support PR Task Lead: Eric Leblond - Suricata contributor Task - Distribute Certificate transparency logs with Cocktailparty Task COCKTAILPARTY-CERTSTREAM Integrate calidog’s certstream watcher/parser in cocktailparty as a new connection/source. Allow for collection from additional log_lists Reference\n- https://github.com/CaliDog/certstream-server Task Lead: Jean-Louis Huynen - Cocktailparty contributor Task - Create admin-defined filters in Cocktailparty Task COCKTAILPARTY-ADMINFILTERS Create admin-defined filters to apply on sources before dispatching to channels. Reference\n- https://github.com/flowintel/cocktailparty Task Lead: Jean-Louis Huynen - Cocktailparty contributor Task - Create user-defined filters in Cocktailparty Task COCKTAILPARTY-USERFILTERS Create user-defined filters to apply on channels, before pushing into the websocket. Reference\n- https://github.com/flowintel/cocktailparty Task Lead: Jean-Louis Huynen - Cocktailparty contributor Task - Improve realtime-py for cocktailparty stream consumption Task COCKTAILPARTY-PYTHON-LIB Upstream realtime-py significantly diverged from flowintel’s current fork. The task consists of reviewing the current code, remove supabase-related parts, play with the library or write tests, and most importantly find a new name =) References\n- https://github.com/flowintel/realtime-py\n- PR dating before upstream refacto Task Lead: Jean-Louis Huynen - Cocktailparty contributor Task - Integrate MISP modules into AIL Task AIL-MISP-Module Task Lead: References\n- AIL\n- MISP Modules Task - Improve AIL Language detection Task AIL-Languages AIL is using CLD3 and a new version of lexilange to detect chats languages. Improve Lexilang’s language dictionary Propose an alternative to CLD3 for language detection that supports a broader range of languages with improved memory efficiency and performance Propose an alternative to ISO 639-3 for representing unsupported regional languages. Task Lead: Aurelien Thirion - AIL Project References\n- AIL\n- Lexilang\n- AIL Languages detection Digital Forensics and Incident Response Delve into tools and methodologies for investigating cyber incidents, uncovering evidence, and responding effectively to mitigate impact.\nEDR and Host-Based Detection Enhance endpoint detection and response (EDR) capabilities with cutting-edge techniques for detecting and mitigating threats at the host level.\nVulnerability Management Develop and refine strategies and tools for identifying, assessing, and prioritizing vulnerabilities to reduce organizational risk.\nTask - Extracting CVE/Vulnerability reference from large datasets such as commoncrawl Task VUL-EXTRACT Extracting CVE/Vulnerability reference from large datasets such as commoncrawl. Adding references into vulnerability-lookup project. Task Lead vulnerability-lookup References\n- https://www.vulnerability-lookup.org/\n- commoncrawl dataset Task - Guessing CPE name based on vulnerability description. Task VUL-CPE-GUESS Facilitating the guessing of a CPE name via natural language processing based on vulnerability description. Task Lead vulnerability-lookup References\n- https://www.vulnerability-lookup.org/\n- cpe-guesser Task - Guessing CPE name with LLM Task VUL-CPE-LLM Facilitating the guessing of a CPE name with LLM. Task Lead Vulnerability-Lookup References\n- https://www.vulnerability-lookup.org\n- VulnTrain Task - Predict exploitability with LLM Task VUL-EXP-LLM Estimating the exploitability of a new vulnerability with LLM. Task Lead Vulnerability-Lookup References\n- https://www.vulnerability-lookup.org\n- VulnTrain Task - Enhanced Vulnerability-Lookup with Code Context Task VUL-Sourcecode-LLM When searching for vulnerabilities, provide relevant code snippets from impacted projects.\nExtend Vulnerability-Lookup database/dataset by linking CVEs with corresponding source code segments from affected products/repositories. Fine tune CodeBert of CodeT5. Task Lead Vulnerability-Lookup References\n- https://www.vulnerability-lookup.org\n- CodeBERT\n- CodeT5 Cybersecurity - Open Data and Open Datasets Use and create open data and datasets to support cybersecurity research, training, and collaborative innovation.\nAPI and Tooling Interoperability Focus on creating and improving APIs and tools that enable seamless integration and interoperability between different cybersecurity platforms.\nTask - Create MISPerer Task: MISPerer MISPerer leverages Anthropics’s Model Context Protocol (MCP) to bridge Large Language Models (LLMs) with the MISP (Malware Information Sharing Platform \u0026 Threat Sharing) system. This simplifies interaction, allowing users and other systems to query MISP’s threat intelligence data through intuitive natural language prompts. Mercator Work on auto-discovery and update of existing objects using the REST API.\nTasks Auto-discovery with nmap: Scan the network to identify active devices and retrieve basic information (IP, open ports, OS fingerprinting). Update server configuration with SNMP: Collect hardware and software information from discovered devices and update Mercator accordingly. Integration with existing inventory data: Cross-reference discovered devices with existing inventory records to update or flag discrepancies. Automated tagging and categorization: Assign tags based on device type, OS, and role in the network. Web UI enhancements: Display real-time discovered devices and provide an interface for manual validation and corrections. Alerting for new/unexpected devices: Notify administrators when unknown or unauthorized devices appear on the network. Cybersecurity Education Create and share educational resources (e.g. CTF challenges), training modules, documentation and workshops to advance knowledge and skills in cybersecurity.\nPolicy and Cybersecurity Improve open source toolings to support policies, regulations, and frameworks to address the challenges and opportunities at the intersection of governance and cybersecurity.\nLookyloo Website capture interface\nTasks Implement dropdown to select which proxy to use for the capture (by country) Virgil Ansible deployment of Lacus, Lookyloo, URL Monitoring and Pandora.\nTasks Review the preliminary playbooks Test the ansible playbooks on live systems Document the installation process Pre-configure the modules from a central file Validate the updating the services works as expected YALTF (Yet Another License Tool and Framework) Tasks: (Click for more details) Expanded OS \u0026 platform support (Windows, macOS) Extend linux support: Extend support to further Linux distributions, particularly Debian and its derivatives that are most used. Explore compressing license data for efficient scanning (additional feat) Windows (SSH-Based): Enable scanning of software on Windows systems accessible via SSH. Windows (native): Implement native scanning on Windows using the WinRM protocol. macOS support: Extend scanning to macOS, including Homebrew-managed packages. Docker compatibility:Support scanning of Docker images to detect license and security issues. Enhanced UI (viewer) (advanced filters, better visualization) Redesign the UI with modern web technologies for a better user experience. Introduce advanced filtering, classification, and compliance-checking features. Display scan summaries and elegantly visualize composite license structures. Expand package scanning capabilities (Flatpak, Snap, npm ...) Scan software installed via distribution-independent package managers (e.g., Flatpak, Snap). Support CLI-based application package managers (e.g., Go modules, npm) for deeper license analysis. Error handling \u0026 logging Improve logging with detailed and actionable diagnostic messages. Display errors and warnings directly in the scan report for better visibility. Interoperability with other tools (ORT, CSV, SML, SPDX...) Enable integration with existing license scanners. Provide outputs compatible with industry-standard tools like ORT for seamless report generation. Support additional output formats, including CSV, XML, SPDX, and more, alongside the existing JSON. Advanced configuration/parameters (Custom output names, locations...) Expand configuration settings to allow custom output directories, report names, and other preferences. Improved accuracy and security (Validation, Vulnerability Detection...) License data validation: Cross-check scan results against online sources to ensure completeness and detect outdated or missing license information. Vulnerability detection: Identify known vulnerabilities (CVEs) in scanned software by referencing security databases. Potentially leveraging lookup service from CIRCL. Weak or insecure configuration detection: Analyze server, database, and software configurations for security misconfigurations that could lead to potential exploits. Testing \u0026 QA (Automated test suits) Develop automated test suites for YALTF to ensure accuracy, reliability, and robustness. YALTF Github Repo\nIDPS-ESCAPE Tasks partially based on the roadmap of IDPS-ESCAPE focusing on the ADBox subsystem\nTasks Suggest (or add) new reusable anomaly detection use case scenarios, i.e., other than the ones geared towards resource usage monitoring Brainstorm on tailoring the underlying ADBox algorithms to specific SOC operations, e.g., to improve the detection of specific types of anomalies, such as those related to user behavior, network traffic, or system performance Enhance the existing Wazuh ADBox integration: improve the visualization and reporting capabilities of ADBox to provide more meaningful insights into detected anomalies Suggest approaches for automating the creation of incident response cases based on ADBox detections, e.g., via the OpenCTI Wazuh connector or the MISP API Improve the scalability and performance of ADBox to handle larger volumes of ingested data Simplify the ADBox engine as well as the training and prediction pipelines train new models for anomaly detection using large amounts of data to assess the performance and accuracy of the underlying anomaly detection algorithm(s) Suggest or add new automated response mechanisms aimed at preventive measures directly integrated into Wazuh, towards the SOAR goal of IDPS-ESCAPE Suggest simulation specifications for pairs of attack scenarios and automated response mechanisms, e.g., to assess the impact of response mechanism suites Algorithmic agility (choosing between multiple algorithms for the same functionality): Integrate different AD algorithms into the ADBox engine to benchmark their performance and accuracy in the context of IDS add efficient algorithmic multiplexing (choosing between multiple implementations of the same algorithm) SATRAP Tasks partially based on the roadmap of SATRAP-DL\nTasks Identify sets of preconditions commonly used to establish correlations (if-then scenarios) to convert to inference rules in SATRAP Implement new inference rules for SATRAP in TypeQL Automate data ingestion from MISP into the SKB of SATRAP: Design and implement a stream-oriented module for retrieving IOCs and other data from a MISP instance and running the SATRAP ETL process on this data, while keeping time and space complexity under control Identify candidate high-level functions to be added to the SATRAP CTIAnalysisToolbox Integrate functions of SATRAP with existing CTI playbooks, similar to the use of PyMISP and pycti, e.g., the threat actor profiling playbook by MISP Suggest performance-related improvements for the SATRAP ETL (Extract-Transform-Load) subsystem, at an algorithmic level Explainable inference: Study the integration of visual explanations in Jupyter Notebooks Add support for ingesting STIX 2.1 custom and metadata objects Reverse ETL: Transform TypeQL results into STIX2.1 objects "},"title":"Topics at hackathon.lu"}}